# Filter and sort data

## Libraries

In [1]:
import pandas as pd
from openpyxl.workbook import workbook

### To continue to work with pandas, we need more methods to organize, compare and sort data

## Problem Statement

* On this notebook, it will be shown some basics ways to manipulate, filter and sort data
* Filtering data based on a proprerty, identifing rows on a singular value in the column ````loc( )````
* Learn how to create columns from existing existing columns
* Learn how to drop columns from the data frame
* Functions ````loc````,````apply````,````lambda````,````drop````,````groupby````,````mean````,````sort````

In [10]:
df_csv = pd.read_csv('Exercise_Files/Names.csv', header=None)
df_csv.columns = ['First','Last', 'Address','City','State','Area Code','Income']
df_csv

,First,Last,Address,City,State,Area Code,Income
0,John,Doe,120 jefferson st.,Riverside,NJ,8074,45000
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,18000
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075,120000
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234,90000
4,NaN,Blankman,NaN,SomeTown,SD,298,30000
5,"Joan ""Danger"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123,68000

### 1.How to filter data based on a property
* Find all people live on Riverside. It can be use the Data frame's location function (````loc````) and index a spot in the DataFrame equals *Riverside*

In [11]:
df_csv.loc[df_csv['City'] == 'Riverside']

,First,Last,Address,City,State,Area Code,Income
0,John,Doe,120 jefferson st.,Riverside,NJ,8074,45000
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075,120000

* The output shows two people living on Riverside

### 2. How to filter data based on several conditions
* It can also specify more than one value. Let's say find all the people that live in Riverside that are also named John.
* It can be used the same method and inside the location index, there are two conditions.

In [12]:
df_csv.loc[(df_csv['City'] == 'Riverside') & (df_csv['First'] == 'John')]

  First Last            Address       City State  Area Code  Income
0  John  Doe  120 jefferson st.  Riverside    NJ       8074   45000

* There are two conditions inside ````[]````
* Every condition must be into parentheses
* It has been used ````&```` to indicates the condition ````and````
* Only one rows was returned because pandas is not recognizing his first name te be John, but rather including his nickname in quotations. So we can see the value of getting multiple properties, *but, sometimes the format of the data does not return how we expected it to*.
* Keep in mind that data should be cleaned in order to avoid to miss some values, especially in larger data sets.

### 3.How to create new column

* Let's work with *Income* column
* Create a new column named *Tax %*
* Intoducing ````apply```` and ````lambda```` functions

In [13]:
df_csv['Tax %'] = df_csv['Income'].apply(lambda x: 0.15 if 10000 < x < 40000 else 0.2 if 40000 < x < 80000 else 0.25)

In [14]:
df_csv

,First,Last,Address,City,State,Area Code,Income,Tax %
0,John,Doe,120 jefferson st.,Riverside,NJ,8074,45000,0.20
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,18000,0.15
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075,120000,0.25
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234,90000,0.25
4,NaN,Blankman,NaN,SomeTown,SD,298,30000,0.15
5,"Joan ""Danger"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123,68000,0.20

* In lambda function, ````x```` is represented by the values of *Income* column
* The column *Tax %* holds the appropiate percentage based on the income row

* Now, let's create a new column based on some simple math and calculate the total amount of taxes they're paying based on their income and percentage

In [15]:
df_csv['Taxes Owed'] = df_csv['Income'] * df_csv['Tax %']

In [16]:
df_csv

,First,Last,Address,City,State,Area Code,Income,Tax %,Taxes Owed
0,John,Doe,120 jefferson st.,Riverside,NJ,8074,45000,0.20,9000.0
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,18000,0.15,2700.0
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075,120000,0.25,30000.0
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234,90000,0.25,22500.0
4,NaN,Blankman,NaN,SomeTown,SD,298,30000,0.15,4500.0
5,"Joan ""Danger"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123,68000,0.20,13600.0

### 4.How to drop columns

* How to drop columns creating a list. Let's drop columns *Area Code*, *First* and *Address*

In [17]:
to_drop = ['Area Code','First','Address']
df_csv.drop(columns=to_drop, inplace=True)

In [18]:
df_csv

       Last         City State  Income  Tax %  Taxes Owed
0       Doe    Riverside    NJ   45000   0.20      9000.0
1  McGinnis        Phila    PA   18000   0.15      2700.0
2    Repici    Riverside    NJ  120000   0.25     30000.0
3     Tyler     SomeTown    SD   90000   0.25     22500.0
4  Blankman     SomeTown    SD   30000   0.15      4500.0
5       Jet  Desert City    CO   68000   0.20     13600.0

### 5. How to create a boolean column
* Let's create a column that indicates True or False in base of a value from *Income* column

In [22]:
df_csv['Test Col'] = False
df_csv.loc[df_csv['Income'] < 60000, 'Test Col'] = True
df_csv

       Last         City State  Income  Tax %  Taxes Owed  Test Col
0       Doe    Riverside    NJ   45000   0.20      9000.0      True
1  McGinnis        Phila    PA   18000   0.15      2700.0      True
2    Repici    Riverside    NJ  120000   0.25     30000.0     False
3     Tyler     SomeTown    SD   90000   0.25     22500.0     False
4  Blankman     SomeTown    SD   30000   0.15      4500.0      True
5       Jet  Desert City    CO   68000   0.20     13600.0     False

### 6. How to group dataset
* The data can be grouped by values of a column
* Use the function ````groupby````
* Let's group data by *Test Col* column

In [21]:
df_csv.groupby(['Test Col']).mean()

                Income     Tax %    Taxes Owed
Test Col
False     92666.666667  0.233333  22033.333333
True      31000.000000  0.166667   5400.000000

### 7. How to order a data set
* Tha data can be sorted by columns
* Use the function ````sort_values````
* It can be used the flag ````ascending```` to indicates how to sort data, ascending (ascending=True) or descending(ascending=False)

In [23]:
df_csv.groupby(['Test Col']).mean().sort_values('Income')

                Income     Tax %    Taxes Owed
Test Col
True      31000.000000  0.166667   5400.000000
False     92666.666667  0.233333  22033.333333

In [25]:
df_csv.groupby(['Test Col']).mean().sort_values('Income',ascending=False)

                Income     Tax %    Taxes Owed
Test Col
False     92666.666667  0.233333  22033.333333
True      31000.000000  0.166667   5400.000000

In [26]:
df_csv.groupby(['Test Col']).mean().sort_values('Income',ascending=True)

                Income     Tax %    Taxes Owed
Test Col
True      31000.000000  0.166667   5400.000000
False     92666.666667  0.233333  22033.333333